[
    {
        "discussion_title": "Autoimmune hepatitis disease",
        "discussion_link": "https://patient.info/forums/discuss/autoimmune-hepatitis-disease-360890",
        "discussion": "Has anybody else got this condition that is willing to discuss their treatment and how they are coping with this disease?I have been living with AIH for 14 years, first diagnosed when i was 14 years old. Luckily I am fairly stable with the odd flare up now and again. I am being looked after by the Queen Elizabeth Hospital in Bham and they are brilliant. Currently im on 50mg of Azathioprine a day and its brilliant with no side effects. I have been on Prednisalone in the past and ive not got on well with it. My doc keeps mentioning the possibility of me having to go back on it in the future but I dont like the  side effects.I am a busy professional who has no time to be poorly, so fingers crossed my Azathioprine continues to do its job!!"
    },
    {
        "discussion_title": "Azathioprine worries!",
        "discussion_link": "https://patient.info/forums/discuss/azathioprine-worries--372775",
        "discussion": "Hello! I was recently admitted to hospital after visiting my GP with persistant stomach pain (about 2 months on and off) and to cut a long story short, a CT scan showed an inflamed bowel which I was told was most likely down to Crohns diesese. I ened up having a small section of bowel removed by the surgeon, and am now back to normal - e.g. no pain or discomfort what so ever, eating and drinking normally, normal bowel movements... in fact you'd never know I had been ill! Now on a follow up at the hospital I have been prescribed Azathioprine tablets. I was given a 30 minute pep-talk by a pharmacist explaining the drug, which if I'm honest terrified me. Risk of cancer, nausea, feeling unwell, reduced bone marrow etc... In fact, lots of very unpleasant side effects. Basically, I feel great right now; 100%, and it sounds like these tablets will make me feel 'not great.' I want to talk to the consultant before I start taking them, but cant get appt until April.From reading posts on the forum, and some general research, it sounds like Azathioprine is used to control inflamation during flare ups, or treat chronic Crohns that is affecting quality of life? Yet I have no symptoms, no pain or discomfort, and feel great. I appreciate that Azathioprine can also be used to prevent Crohns from coming back again, but with all the associated risks, and I gather you can only take it for a total of around five years before it stops working, is now the right time for me to be starting this drug? Should it not be held in reserve in case I have problems in the future?Yes, I will be guided by my doctor, but until I can get to see him, I just wanted to get some feedback from anyone else on here using Azathioprine. Has anyone been in my position and started taking it? Sorry if I sound like an idiot - I'm feeling very confused and a little concerned about this drug. Do I really want to take something that will make me feel worse than I do now, and possibly even give me cancer? Any feedback greatfully received!   "
    },
    {
        "discussion_title": "Azathioprine - combatting side effects/fatigue",
        "discussion_link": "https://patient.info/forums/discuss/azathioprine-combatting-side-effects-fatigue-402523",
        "discussion": "I am on my 4th week of taking 75mg of azathiporine for Ulcerative Colitis. I have that read that many suffer side-effects which include nausea & vomiting but so far I have not experinced this. I  am having weekly blood tests to monitor my bone marrow levels a dose of prednisolone is tapering down & should be at nil in 4 weeks which will make 8 weeks for the azathioprine to have bed in.The main side effect I am beginning to experience is extreme fatigue. I am presently taking the 75mg in the morning along w/ the steroids but I have heard that some people take the azathiporine at night & that this can aleviate some fatigue symptoms. Does anyone else have any experience of this & whether this can help? Does the fatigue go away or is this something I will just have to get used to?I have also wondered about a ginseng or eleuthero (Siberian ginseng) supplement to help.Any help / insight any of you might be able to provide would be greatly appreciated.Thanks "
    },
    {
        "discussion_title": "Is this a liver flare or something else",
        "discussion_link": "https://patient.info/forums/discuss/is-this-a-liver-flare-or-something-else-631712",
        "discussion": "For last two days I have been n still am confined to bed I have autoimmune hep on 5 mg pred 50 aza I have mucus on chest no energy feel as if will pass out when stand chest feels as if I've been hit I've lost 3 pounds in weight I started eating very healthy day before this started coughing away mucus on chest so I'm resting continuely eyes filled with water eyes hurting when I move them can't watch tv as screen to bright, I don't think it's flu as no temp dry throat very little mucus in nose has any one nah idea of what could be. Slept 14 hrs yesterday straight just feel so exhausted For last two days I have been n still am confined to bed I have autoimmune hep on 5 mg pred 50 aza I have mucus on chest no energy feel as if will pass out when stand chest feels as if I've been hit I've lost 3 pounds in weight I started eating very healthy day before this started coughing away mucus on chest so I'm resting continuely eyes filled with water eyes hurting when I move them can't watch tv as screen to bright, I don't think it's flu as no temp dry throat very little mucus in nose has any one nah idea of what could be. Slept 14 hrs yesterday straight just feel so exhausted "
    },
    {
        "discussion_title": "I am 64 and very recently diagnosed with AIH.",
        "discussion_link": "https://patient.info/forums/discuss/i-am-64-and-very-recently-diagnosed-with-aih--610048",
        "discussion": "I was referred to a liver specialist when my GP noticed some high liver levels following regular blood work. I am scheduled for an ultra sound at the end of the month and a follow-up visit with the specialist in Nov. I have ranged from being panicky, to upset, to worried, to constantly talking myself into staying calm. I have had anxiety problems recently so that is no easy feat. I am very happy to have found this page. I have been reading some of the experiences of others just like me. Keeping my fingers crossed that things will be alright. "
    },
    {
        "discussion_title": "azathioprine - crohn's",
        "discussion_link": "https://patient.info/forums/discuss/azathioprine-crohn-s-12825",
        "discussion": "Hi,I've been on Azathioprine 25mg for 2 weeks, plus slowly reducing dose of steroids (now on 20mg), and started having quite high temperature (102).The temperature goes up straight after I have my breakfast and the medication and then wears off in the evening. Has anyone had similar reaction? I really don't know if my body is just adjusting to this drug or if I should stop taking it. I'm so confused, don't know anymore if I'm feeling worse because I'm weening off steroids or because I on Azathioprine.The GP advised me to stop taking.Anyone with similar problem ??Thanks"
    },
    {
        "discussion_title": "Nausea and vomiting on Azathioprine",
        "discussion_link": "https://patient.info/forums/discuss/nausea-and-vomiting-on-azathioprine-452828",
        "discussion": "i was diagnosed with UC in April this year and currently taking prednisone and Azathioprine. My specialist is reducing my prednisone dose while slowly upping my Aza dose. I've been on Aza for 4 weeks now and things started off well but the last week I have started really bad nausea and vomiting which starts around 2 hours after I take the tablet and lasts for around 2-3 hours. I use to take the tablets in the morning after breakfast but due to the vomiting I changed to after dinner so it doesn't effect my work life. I always take after food but it doesn't seem to make a difference.  Day 9 and I'm struggling and feel like I'm at breaking point. Has anyone else had a similar experience? My specialist has just suggested seeing if the side effects subside but I'm over it.  "
    },
    {
        "discussion_title": "Autoimmune hepatitis.",
        "discussion_link": "https://patient.info/forums/discuss/autoimmune-hepatitis--29758",
        "discussion": "I was diagonised with autoimmune hepatitis 3 years ago.  This was caused by a virus which attack my immune system and in turn affected my liver.  I had blood reading over 8 and 900 which should have been about 20 or 30. I was started on steroids, (15mg per day).  This brought my blood reading back to normal.  Then the steroids were reduced to 10mg per day. and the readings shot up to over 300. The steroids were increased to 30mg per day and azathioprine was also given, (doseage 150mg per day).  This tablet enabled me to lover the steroids, and I am now down to 10mg per day plus the 150mg azathioprine.  I just hate the way I look.  I have not gained a lot of weight, but look and feel puffy. My doctor has told me that I will be on steroids for the rest of my life. I am 65 years old."
    },
    {
        "discussion_title": "Autoimmune hepititis / tooth decay / needing extractions",
        "discussion_link": "https://patient.info/forums/discuss/autoimmune-hepititis-tooth-decay-needing-extractions-550677",
        "discussion": "I am very worried having lost half of front tooth last night as have auto hep and other autoimmune diseases I'm 59 female on azathrioprine 75 mg steriods 5 mg having had auto hep for 9 years I went to dentist this morning he won't do anything until I contact my liver specialist due to the blood clotting issue I'm terrified of dentists haven't been for approx 9 years he is saying I can either have bridge or implant I'm so scared of having anything done to be honest as I just don't fare well at dentists having had bad experiences in past at mo my imflamation level in my body is rising I also suffer from post viral fatigue syndrome so don't have much energy at all I'm very interested in other ppls take on itI am very worried having lost half of front tooth last night as have auto hep and other autoimmune diseases I'm 59 female on azathrioprine 75 mg steriods 5 mg having had auto hep for 9 years I went to dentist this morning he won't do anything until I contact my liver specialist due to the blood clotting issue I'm terrified of dentists haven't been for approx 9 years he is saying I can either have bridge or implant I'm so scared of having anything done to be honest as I just don't fare well at dentists having had bad experiences in past at mo my imflamation level in my body is rising I also suffer from post viral fatigue syndrome so don't have much energy at all I'm very interested in other ppls take on it"
    },
    {
        "discussion_title": "New to the medication",
        "discussion_link": "https://patient.info/forums/discuss/new-to-the-medication-519981",
        "discussion": "HiGreat to read all your stories, I am recently diagnosed with AIH and hate telling people as they think the worst. I'm based in Ireland. I am currently on steroids and weaning myself off I started 50mg of imuran and moved to 100mg but I have honestly never been so sick and was told this week to reduce back to 50mg as my professor was away I took the 50mg last night before I went to bed and within an hour I woke up really unwell and was vomiting. I am so reluctant to take them as they are making me feel so unwell I really didn't realise they would do this. I have had rheumatoid arthritis for several years and non of the other medication has made me feel this bad.  I would love to discuss with anyone or here if you had any ways to get over this feeling as I  trying to explain to my family  but I am normally very strong but finding it hard this week Thanks and great reading all your stories HiGreat to read all your stories, I am recently diagnosed with AIH and hate telling people as they think the worst. I'm based in Ireland. I am currently on steroids and weaning myself off I started 50mg of imuran and moved to 100mg but I have honestly never been so sick and was told this week to reduce back to 50mg as my professor was away I took the 50mg last night before I went to bed and within an hour I woke up really unwell and was vomiting. I am so reluctant to take them as they are making me feel so unwell I really didn't realise they would do this. I have had rheumatoid arthritis for several years and non of the other medication has made me feel this bad.  I would love to discuss with anyone or here if you had any ways to get over this feeling as I  trying to explain to my family  but I am normally very strong but finding it hard this week Thanks and great reading all your stories "
    },
    {
        "discussion_title": "Azathioprine for eczema",
        "discussion_link": "https://patient.info/forums/discuss/azathioprine-for-eczema-500954",
        "discussion": "Has anyone out there benn prescribed Azathioprine for atopic eczema?  If so, what results have you had - any improvement? "
    },
    {
        "discussion_title": "I have just started on my 3rd week of Azathioprine, I am...",
        "discussion_link": "https://patient.info/forums/discuss/i-have-just-started-on-my-3rd-week-of-azathioprine-i-am--251",
        "discussion": "I have just started on my 3rd week of Azathioprine, I am experiencing a sympton of irregular breathing, almost like a panic attack along with what seems to be an irregular hearbeat. The symptons are not severe but alarming. Are these symptoms possible from the use of azathioprine along with the simultanious reduction of Prednisolone?Drug dose at this point 150 MG Azathioprine daily and 20 MG Prednisolone alt days.Site comments, glad i found it, it is reasuring in side affect description will read on.Many kind regardsEL Moore[i:05fc8b3d53]This message was automatically imported from the original Patient Experience[/i:05fc8b3d53]"
    },
    {
        "discussion_title": "Having been reading side effects of azathioprine..imuran",
        "discussion_link": "https://patient.info/forums/discuss/having-been-reading-side-effects-of-azathioprine-imuran-466266",
        "discussion": "i was diagnosed with auto immune desease about 3 years now, and taking imuran.  I hate medication, although I know sometimes you must take it, but I was reading side effects of imuran....I alway have metallic taste in my mouth and itchy skin or scalp.  Drives me nuts.  When I was diagnosed, I was told I have schlorisis (spelling?) of the liver.  Frightening.  However, I feel healthy, don't really have any problems other than that which I just mentioned...but I hate taking medicine.  Was looking on Internet for all side effects and that, in itself, is a bit scary.  Cancer, cancer, cancer.  I would love to come of the imuran, but I suspect that is not a go.  I have to go back to USA for complete checkup and blood work to see how I m doing, but I wanted to talk to others who are going through the same thing.  You would think they would be able to clome up with something that would stop our own cells from destroying good cells.  Anyway, I have enjoyed reading all comments...it helps to know how others are coping.  I guess I will continue with imuran .....at least till I see doctor.  Thanks to all for being informative.  Good luck to everyone."
    },
    {
        "discussion_title": "I had been prescribed Azathioprine (150mg/day) in conjun...",
        "discussion_link": "https://patient.info/forums/discuss/i-had-been-prescribed-azathioprine-150mg-day-in-conjun--1037",
        "discussion": "I had been prescribed Azathioprine (150mg/day) in conjunction with prednisolone (20mg/day) as a means of transition off of the steroid treatment.Shortly after a week of taking Azathioprine I became unwell; completely lost my appetite (due to sometime feeling full or even sick); developed a high temperature; had some dizzy spells; experienced severe aching in joints and muscles from head to foot; developed a severe outbreak of spots all over head and neck as well as on chest back and limbs to a lesser extent.Unfortunately I had thought that the initial effects that I was seeing (temperature, aching) were associated with lowered resistance to a cold to which I had been exposed, rather than an actual reaction to the drug.Fortunately I had been in close touch with my GP that week and his support was excellent.  Once off of the drug the reversal of symptons was very quick, most within a day, and now only a couple of days later I feel much better again, and only a very small proportion of the spots remain.In hindsight I can see how ill I became, but at the time I think that mentally I also couldn't function efficiently (conversation and concentration were extremely difficult) making it hard to see how its effect had been gradually worsening as I continued to take the drug.  I think this shows that it's important to remember how side effects can build up gradually and not always appear instantly one or two days after you start a course of treatment.:ill::ill:[i:b921c9e26b]This message was automatically imported from the original Patient Experience[/i:b921c9e26b]"
    },
    {
        "discussion_title": "Help with mercaptorurine side effects please",
        "discussion_link": "https://patient.info/forums/discuss/help-with-mercaptorurine-side-effects-please-404354",
        "discussion": "hello I took mezalazine for 20 years, I was having a lot of flare ups and tests show I have a 12 inch stricture/narrowing I was put on azaphapine but I felt so tired and the soles of my feet felt like I was walking on pins. My specialist changed my tablets to mercaptorurine 2x 50 mg daily originally I was on one tablet and I wasn't too bad since the increase I have the side affects that I had with the azathaprine the tiredness is the main problem I've tried to not let it stop me doing what I want in my leisure time but it's starting to become more difficult as I also gave a full time job to keep down I just want to go to bed as soon as I get in these side effects seem to not be uncommon how do people cope with the side effects ? The only alternative is a operation any advise please ? Jon "
    },
    {
        "discussion_title": "petrified... so many side affects",
        "discussion_link": "https://patient.info/forums/discuss/petrified-so-many-side-affects-404349",
        "discussion": "Hi...I'm absolutely petrified at the thought of taking this medication... There are so many side affects and I don't want to get more diseases through treating crohns disease... The thought of getting cancer makes me feel sick... I have two little boys that need their mummy. My crohns is active as my sample inflammation levels came back at 458 but I am symptom free and feel 100% How does anyone else feel on this medication? I'm due to start it soon but feeling rather doubtful. "
    },
    {
        "discussion_title": "I was off azathioprine for a few months and began to fee...",
        "discussion_link": "https://patient.info/forums/discuss/i-was-off-azathioprine-for-a-few-months-and-began-to-fee--1495",
        "discussion": "I was off azathioprine for a few months and began to feel much better, I didn't suffer so many of the colds and viruses which I did previously.  Due to yet another flare-up of ulcerative colitis I was immediately put back on azathioprine and as a result I am suffering with continuous colds etc..  I know that I have to balance the advantages with the disadvantages of living with the disease and facing surgery or taking the medication and constantly suffer from other illnesses.  I would love to hear of others who are in the same position as I am, it makes me miserable sometimes and I get fed up listening to myself moaning!!![i:c66777191f]This message was automatically imported from the original Patient Experience[/i:c66777191f]"
    },
    {
        "discussion_title": "Just about to start taking Azathioprine.",
        "discussion_link": "https://patient.info/forums/discuss/just-about-to-start-taking-azathioprine--297757",
        "discussion": "hi everyone, I was diagnosed with Crohn's in 2003 when rushed into hospital with stomach pains, which resulted in an 8 week stay and an operation to removed a 6inch infected part of my bowel. I have since then been given various drugs to maintain the Crohn's which in all I've managed to get by, but over the last year it's been getting worse. So my specialist has recommended I go on Azathioprine, after reading up the side affects it causes I am now thinking it's not a good idea to start taking them. The lowered immune system is bad enough but the chances of cancers and tumours are making me think I'll just carry on muddling by like I have done for years. Sorry for for babbling on, I just wanted to know if anyone else has been on these long term and had any of the major side effects?"
    },
    {
        "discussion_title": "Azathioprine with ulcerative colitis ",
        "discussion_link": "https://patient.info/forums/discuss/azathioprine-with-ulcerative-colitis-216440",
        "discussion": "Hi guys wonder if anyone can help ive been on azathioprine for Approx 6 weeks and the last 2 weeks have been hell !! My knees feel like they've been shot im not sleeping in the nights always have a headache cold sores chesty cough sinus trouble ! Think thats about it lol just wondered if this is ever going to stop or at what point should i tell my doctor about this ? "
    },
    {
        "discussion_title": "Mercaptopurine or Not?? Don't Know What to Do!!",
        "discussion_link": "https://patient.info/forums/discuss/mercaptopurine-or-not-don-t-know-what-to-do--372628",
        "discussion": "My Consultant is trying to convince me to take Mercaptopurine.  That to take this drug therapy could mean avoiding surgery for longer.I have had Crohn's for twenty-five years and have always used a liquid diet instead of drugs to treat aggressive flares.  This is because the steroids and immunosuppressants made me far more ill in the past!  The liquid diets are always hard but do actually work.  But I have had three resections since 1994 and I really don't want anymore.Can anyone out there give me any advice or share some wisdom with me on this as I really don't know what to do??Thanks"
    },
    {
        "discussion_title": "Sick with Fever, Chills, Aches, Arh!",
        "discussion_link": "https://patient.info/forums/discuss/sick-with-fever-chills-aches-arh--284669",
        "discussion": "I have Refractory Celiac Disease (RCD) which means I am not recovering from eating a gluten free diet.  I have been on AZA now for 18 days.  I'm super sick, running a temp, and just feeling overall onder the weather.  I was perfectly healty for 50 years and then slowly became very ill.  I want my life back!  I hope tomorrow is a better day. "
    },
    {
        "discussion_title": "I was diagnosed with UC in 2001 and have been taking Azathioprine ever since.",
        "discussion_link": "https://patient.info/forums/discuss/i-was-diagnosed-with-uc-in-2001-and-have-been-taking-azathioprine-ever-since--300293",
        "discussion": "I feel that 13 years is a long time to be taking Aza and am thinking very seriously about withdrawing from the drug. My doctor tells me that if I do I will be playing with fire. The drug has given me a better quality of life while on it but as I become older (I'm 56) I'm concerned that I'll develop bone marrow or skin cancer. It's quite frightening to think about it but it's a toss up between my UC issues returning or staying on Aza. Has anyone actually tried this after long term use of Aza?"
    },
    {
        "discussion_title": "Help with azathioprine ",
        "discussion_link": "https://patient.info/forums/discuss/help-with-azathioprine-297669",
        "discussion": "I have been taking azathioprine for 3 months for ulcerative colitis, for the last 3 weeks on and off but mostly on I've had a constant headache, stiff painfull neck felt like I've got a virus or flu at times and sleeping excessively is this down to the azathioprine and if so how long after I stop taking it  until I feel well again"
    },
    {
        "discussion_title": "Help with azathiophine  side effects",
        "discussion_link": "https://patient.info/forums/discuss/help-with-azathiophine-side-effects-295547",
        "discussion": "Hi keep it as short as possible I have had chrohns for 20 years initially took steroids then mezalazine up until recently. I was in pain on and off so I had a colonoscopy and a 12 inch stricture was found so I'm now on azathiophine but after 3 months I have two side effects 1 iam tired all the while 2 my feet are so sore they feel I have walked 30 miles also my heels are v painful if I knock them also I seem to get headaches. I have 2 questions should I just have the op to remove the stricture which I have been offered but not  necessary as I'm pain free look well not loosing weight etc ? But my main concern is this what health issues am I going to have in say two or three years of taking this drug? My teeth just crumble away and 2 years ago a surgeon was all for doing a full shoulder replacement all because of me taking steroids years ago I'm going to discuss this with my GP but I cannot get an appointment for 3 weeks to see her can anyone give any advice in the meantime please ? Jon   "
    },
    {
        "discussion_title": "Soon to start Azathioprine, a little worried...",
        "discussion_link": "https://patient.info/forums/discuss/soon-to-start-azathioprine-a-little-worried--259433",
        "discussion": "Hello everyone, I've had Ulcerative Colitis for a few years now, I was doing ok on Mezavant XL until last year when I had my worst flare up ever that put me in hospital. I was on steroids through an iv and was sent home on oral prednisolone.They eventually worked after about 5 weeks & I started feeling better. Ive been ok now since February, but all of a sudden I've got a mild flare up again. I've been having Colifoam Enemas for the last week to try and stop the flare up in its tracks. I think its too early to say if anythings really happening. I'm supposed to have them for another week & see how things go. If by next week I'm no better I'm gonna have to have another go of oral prednisolone. Except this time I'm going to be taken off my Mezavant XL & go onto Azathioprine. I'm a little worried because last time I talked about it with my doctor he said it is a 50/50 wether I respond well to it. The list of possible side effects is quite something as well, weakening of the immune system, a possibility of a couple types of cancer, nausea & vomiting etc and on top of that it apparently takes about 10-12 weeks to do anything ...if it does anything at allI'd like some advice please off anyone who has been/is on on Azathioprine, what its like, how bad is it, is it worth the risks basically Thanks in advanceAndy"
    },
    {
        "discussion_title": "I'm an Azathioprine old-timer!",
        "discussion_link": "https://patient.info/forums/discuss/i-m-an-azathioprine-old-timer--24048",
        "discussion": "I am almost 30 and have had ulcerative colitis for 17 years...when I was a teenager, I had a flare up every few weeks and-after countless courses of steroids-which left me riddled with side-effects and unable to live anything even close to a normal teenage life, my doctor put me on Azathioprine 14 years ago. I'm not saying it's been plain sailing, but I truly believe this drug got me through a very stressful undergrad degree at Oxford, a postgraduate degree and every day that I work in my dream job as a broadcast journalist.  Sadly, I have been on the drug so long, the honeymoon is all but over...I can't go out in the sunshine without breaking out in a fierce rash now, too much sunlight makes me so tired I could sleep for hours, I bruise black ad blue every time I sit down too hard and last year I had such severe shingles I still haven't properly recovered. For all that I now feel dizzy and sick most days, I know Azathioprine has given me a very good life these past 15 years. I'm probably going to have to stop taking it...bit would urge anyone deliberating over whether to start, to give it a go...of really is a wonder drug...temporarily at least! Good luck!"
    },
    {
        "discussion_title": "I have been taking 100mg of azathioprine for a little ov...",
        "discussion_link": "https://patient.info/forums/discuss/i-have-been-taking-100mg-of-azathioprine-for-a-little-ov--1149",
        "discussion": "I have been taking 100mg of azathioprine for a little over a year now following a bad bout of ulcerative colitis, my consultant would like to keep me on it for at least another year.  For the past few weeks I have constantly been feeling unwell.  There are so many viruses going around at the moment and because I have three kids in school, I think that I am catching the viruses or bugs which are around.  I don't ever remember having one infection or virus after another.  Has anyone else, who takes azathioprine had the same problem?:[i:2e8ffec2da]This message was automatically imported from the original Patient Experience[/i:2e8ffec2da]"
    }
]